app/Controllers/Admin/Produk.php

    public function insert()
    {
        $product_name = $this->request->getVar('product_name');
        $prduct_price = $this->request->getVar('product_price');
        $product_description = $this->request->getVar('product_description');

        $data = [
            'product_name' => $product_name,
            'product_price' => $prduct_price,
            'product_description' => $product_description
        ];

        $mProduct = new mProduct();
        $mProduct->insert($data);
---
INSERT INTO `product` (`product_name`, `product_price`, `product_description`) VALUES ('Kemeja apatu', '30000000', 'Apamen yaa')

    public function delete($id_product = '1')
    {
        $mProduct = new mProduct();
        $mProduct->where('id_product', $id_product)->delete();
---
DELETE FROM `product`
WHERE `id_product` = '19'

    public function edit($id_product)
    {
        $mProduct = new mProduct();
        $product_row = $mProduct->where('id_product', $id_product)->first();
---
SELECT *
FROM `product`
WHERE `id_product` = '19'
 LIMIT 1

    public function update($id_product)
    {
        $product_name = $this->request->getVar('product_name');
        $prduct_price = $this->request->getVar('product_price');
        $product_description = $this->request->getVar('product_description');

        $data = [
            'product_name' => $product_name,
            'product_price' => $prduct_price,
            'product_description' => $product_description
        ];

        $mProduct = new mProduct();
        $mProduct->where('id_product', $id_product)->set($data)->update();
---
UPDATE `product` SET `product_name` = 'Kebaya Apatu', `product_price` = '30000000', `product_description` = 'Apamen Yaaa'
WHERE `id_product` = '19'